In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [5]:
data=[1,2,3,4,5]
df_1=pd.DataFrame(data)
df_1

   0
0  1
1  2
2  3
3  4
4  5

In [7]:
data=[1,2,3,5,6,7,7]
i=[1,2,3,4,'a','b',5]
df = pd.DataFrame(data,index=i,columns=['a'])
df

   a
1  1
2  2
3  3
4  5
a  6
b  7
5  7

In [9]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'],dtype=float)
df

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

In [10]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
df

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [11]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
df

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [12]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [13]:
data = [{'x': 1, 'y': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)
df

     a     b     c    x    y
0  NaN   NaN   NaN  1.0  2.0
1  5.0  10.0  20.0  NaN  NaN

In [14]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data,index=['first','second'],columns=['a','b'])
df

        a   b
first   1   2
second  5  10

In [15]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [19]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3,4], index=['a', 'b', 'x', 'd'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  NaN
d  NaN  4.0
x  NaN  3.0

In [21]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df['one'])

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [22]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df['three']=pd.Series([10,20,30,40],index=['a','b','c','d'])
df

   one  two  three
a  1.0    1     10
b  2.0    2     20
c  3.0    3     30
d  NaN    4     40

In [23]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df['four']=df['one']+df['two']
df

   one  two  four
a  1.0    1   2.0
b  2.0    2   4.0
c  3.0    3   6.0
d  NaN    4   NaN

In [25]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df['four']=df['one']+df['two']
print(df)

del(df['one'])
df

   one  two  four
a  1.0    1   2.0
b  2.0    2   4.0
c  3.0    3   6.0
d  NaN    4   NaN

   two  four
a    1   2.0
b    2   4.0
c    3   6.0
d    4   NaN

In [28]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df['four']=df['one']+df['two']
print(df)
df.pop('two')
print(df)

   one  two  four
a  1.0    1   2.0
b  2.0    2   4.0
c  3.0    3   6.0
d  NaN    4   NaN
   one  four
a  1.0   2.0
b  2.0   4.0
c  3.0   6.0
d  NaN   NaN

In [29]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [33]:
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)

print(df.loc['a'])
print(df.iloc[2])

one    1.0
two    1.0
Name: a, dtype: float64
one    3.0
two    3.0
Name: c, dtype: float64

In [47]:
df = pd.DataFrame([[1, 2], [3, 4]],index=['a','b'], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]],index=['a','b'] ,columns = ['a','b'])

df = df.append(df2)
print(df)
print(df.loc['a'])

   a  b
a  1  2
b  3  4
a  5  6
b  7  8
   a  b
a  1  2
a  5  6

In [48]:
df = pd.DataFrame([[1, 2], [3, 4]],index=['a','b'], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]],index=['a','b'] ,columns = ['a','b'])

df = df.append(df2)
print(df)
df=df.drop('a')

print(df)

   a  b
a  1  2
b  3  4
a  5  6
b  7  8
   a  b
b  3  4
b  7  8